; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
; params: miconic -f 10 -p 4 -r 835098955






(define (problem mixed-f10-p4-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)

(above f6 f7)
(above f6 f8)
(above f6 f9)

(above f7 f8)
(above f7 f9)

(above f8 f9)



(origin p0 f5)
(destin p0 f7)

(origin p1 f4)
(destin p1 f9)

(origin p2 f2)
(destin p2 f3)

(origin p3 f6)
(destin p3 f3)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
))
)

; plan
1. (up f0 f9)
   deleted: (lift-at f0)
   added: (lift-at f9)
   goals met: 0 of 4
2. (down f9 f6)
   deleted: (lift-at f9)
   added: (lift-at f6)
   goals met: 0 of 4
3. (board f6 p3)
   added: (boarded p3)
   goals met: 0 of 4
4. (up f6 f9)
   deleted: (lift-at f6)
   added: (lift-at f9)
   goals met: 0 of 4
5. (down f9 f5)
   deleted: (lift-at f9)
   added: (lift-at f5)
   goals met: 0 of 4
6. (board f5 p0)
   added: (boarded p0)
   goals met: 0 of 4
7. (up f5 f9)
   deleted: (lift-at f5)
   added: (lift-at f9)
   goals met: 0 of 4
8. (down f9 f7)
   deleted: (lift-at f9)
   added: (lift-at f7)
   goals met: 0 of 4
9. (depart f7 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 1 of 4
10. (up f7 f9)
   deleted: (lift-at f7)
   added: (lift-at f9)
   goals met: 1 of 4
11. (down f9 f4)
   deleted: (lift-at f9)
   added: (lift-at f4)
   goals met: 1 of 4
12. (board f4 p1)
   added: (boarded p1)
   goals met: 1 of 4
13. (up f4 f9)
   deleted: (lift-at f4)
   added: (lift-at f9)
   goals met: 1 of 4
14. (depart f9 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 2 of 4
15. (down f9 f3)
   deleted: (lift-at f9)
   added: (lift-at f3)
   goals met: 2 of 4
16. (depart f3 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 3 of 4
17. (down f3 f2)
   deleted: (lift-at f3)
   added: (lift-at f2)
   goals met: 3 of 4
18. (board f2 p2)
   added: (boarded p2)
   goals met: 3 of 4
19. (up f2 f3)
   deleted: (lift-at f2)
   added: (lift-at f3)
   goals met: 3 of 4
20. (depart f3 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 4 of 4
